# WorksetJoinWarn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AutoJoinFailures..::..WorksetJoinWarn Property
BuiltInFailures..::..AutoJoinFailures Class See Also
---
Two elements were not automatically joined because one or both is not editable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WorksetJoinWarn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WorksetJoinWarn As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WorksetJoinWarn {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AutoJoinFailures Class
Autodesk.Revit.DB Namespace